import pandas as pd
from fin_ml.utils.ewm import ewm_var


def get_daily_vol(close, span=100):    
    """일별 변동성을 계산한다
    """
    # 일별 거래량, 종가에 따라 재인덱싱
    _day_before = close.index - pd.Timedelta(days=1)                       # 인덱스 날짜에서 1일을 빼준다.
    _day_before_index = close.index.searchsorted(_day_before)              # _day_before 값이 들어갈 수 있는 인덱스 위치를 찾아준다.   0,2,4,6,8  인덱스 중 [3, 7]의 인덱스 위치를 찾는 경우 리턴 값은 [2, 4]을 리턴
    _day_before_index = _day_before_index[_day_before_index > 0]           # 0 보다 큰 인덱스 값만 취함
    _offset = len(close) - len(_day_before_index)                          # 데이터가 시작할 offset 값을 구한다.
    
    '''df의 인덱스에는 하루 전 날짜 인덱스 값이 들어가게 되고,
    df의 value에는 인덱스값 대비 24시간 이내에 대응되는 close 인덱스 날짜가 매칭된다. 
    day_before_index      day_before_index에 대응되는 close index 날짜
    2010-10-04 09:30:00.000000   2010-09-30 15:59:30.000000
    2010-10-04 09:35:05.000000   2010-09-30 15:59:30.000000
    2010-10-04 09:55:29.000000   2010-09-30 15:59:30.000000
    2010-10-04 10:01:06.000001   2010-09-30 15:59:30.000000
    2010-10-04 11:15:44.000000   2010-09-30 15:59:30.000000
    2010-10-04 13:01:24.000000   2010-09-30 15:59:30.000000
    2010-10-05 10:24:16.000009   2010-10-04 10:01:06.000001
    2010-10-06 11:15:56.000000   2010-10-05 10:24:16.000009
    2010-10-06 13:54:53.000003   2010-10-05 10:24:16.000009
    2010-10-15 11:50:47.000000   2010-10-06 13:54:53.000003
    2010-10-15 13:46:32.000000   2010-10-06 13:54:53.000003
    2010-10-15 14:09:16.000002   2010-10-06 13:54:53.000003
    2010-10-18 09:51:56.000000   2010-10-15 14:09:16.000002
    2010-10-18 10:07:03.000000   2010-10-15 14:09:16.000002
    2010-10-18 15:09:13.000000   2010-10-15 14:09:16.000002
    2010-10-19 09:30:04.000006   2010-10-15 14:09:16.000002
    2010-10-19 14:39:05.000000   2010-10-18 10:07:03.000000
    2010-10-20 12:03:34.000000   2010-10-19 09:30:04.000006
    2010-10-20 12:03:34.000003   2010-10-19 09:30:04.000006
    2010-10-26 14:04:59.000000   2010-10-20 12:03:34.000003
    2010-10-26 14:26:10.000000   2010-10-20 12:03:34.000003
    '''
    df = pd.Series(close.index[_day_before_index - 1], index=close.index[_offset:])
    df = close.loc[df.index] / close.loc[df.array].array - 1                # 위에서 구한 인덱스 기준으로 수익률을 구한다.
    # df = ewm_var(df, span=span, std=True)
    df = df.ewm(span=span).std()                                            # 수익률의 가중이동 표준편차를 구한다.
    return df
